{
  "level":{
    "category":1,
    "level":4,
    
  "welcome_modal": {
    "title": "Category 1 Level 4",
    "text": "In the fourth level, the hero gains a new ability - using the lever. He would need this ability to deactivate the traps in the road and to open the door.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All tasks completed!",
    "text": "You have successfully learned the ability to use a lever with a hero. The next level follows.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "The road to the first stone button is blocked by several barrels and closed doors. Destroy the barrels and use the lever.",
    "image": "maintask0_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "Your first algorithm at this level allowed the hero to chop the barrels standing in the path and open the door using the lever.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "The second task assignment",
    "text": "In this role the hero awaits a longer journey, which includes jumping, destroying boxes and circumventing traps.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your second task!",
    "text": "Well done! Your second algorithm allowed the hero to successfully reach the target and overcome all obstacles.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "The third task assignment",
    "text": "The hero's path is blocked by two successive traps that cannot be avoided. Fortunately, the levers to turn them off are nearby, use them.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your third task!",
    "text": "In your third algorithm, you used both levers and so the hero successfully overcomes a dangerous obstacle.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fourth task assignment",
    "text": "And this is the last task of this level, in which the door must be opened again. Open with the lever behind the vase.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your fourth task!",
    "text": "You have proven that using the lever is as easy for you as jumping and sword swinging.",
    "image": "success"
  }
  }

}