{
  "level":{
    "category":2,
    "level":2,
    
  "welcome_modal": {
    "title": "Category 2 Level 2",
    "text": "In the second level of the second hero category you get a new block - repeat x times. This is a for loop that executes all the blocks you attach to it as many times as you set. This is useful if you need to perform a sequence of blocks several times in a row to complete the task.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All tasks completed!",
    "text": "You have successfully learned to work with a for loop.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "In the first task, all you need is one-step motion and rotation blocks. Place them in the block repeated x times and set the correct number of repetitions. In the beginning, the hero is directed to the right.",
    "image": "maintask0_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "In your first algorithm, you correctly used and set up the for loop to allow the hero to go to the first stone button.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "40",  
  
    "introduction_modal": {
    "title": "The second task assignment",
    "text": "Now the hero needs to jump over the water. This can be greatly optimized using the repeat block x times, and two such blocks must be used to accomplish this task. Start by directing the hero up, and then use the repeating blocks so that the second is inside the first.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Great! You've done your second task!",
    "text": "You've mastered a nested for loop, and the hero can continue on his way.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "60",  
  
    "introduction_modal": {
    "title": "The third task assignment",
    "text": "In this task we have a stone button behind closed doors that are locked with a key that we have to find in the chest. So the hero needs to open all the chests. Use the repeat block x times, move the block and rotate clockwise.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Great! You've done your third task!",
    "text": "In your third algorithm you opened 6 chests, the hero found the key and got through the closed door.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "80",  
  
    "introduction_modal": {
    "title": "The fourth task assignment",
    "text": "The way to the stone button to accomplish this task is blocked by vases that need to be destroyed. Once again, use the repeat block x times.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your fourth task!",
    "text": "It doesn't seem to be a problem to optimize your algorithms with a for loop. One more task and you're going to finish this level.",
    "image": "success"
  }
  },
  
      "mainTask4": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fifth task assignment",
    "text": "And to complete the level, just use two levers to defeat the traps blocking access to the target. In the beginning, point the hero down and use the repeat block x twice.",
    "image": "maintask4_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your fifth task!",
    "text": "Well done, your hero already has a target within reach.",
    "image": "success"
  }
  }


}