{
  "level":{
    "category":1,
    "level":1,
    
   "welcome_modal": {
    "title": "Vitajte v Blockly hre!",
    "text": "V prvej úrovni si predstavíme základ ovládania, ktorým je pohyb. Hrdina sa dokáže pohybovať v štyroch smeroch. Vyberte blok s potrebným smerom pohybu, pripojte ho k bloku hráča a  nastavte počet krokov. Potom kliknite na tlačidlo Spustiť bloky. Vaša herná postava sa potom pokúsi výkonať príkazy. Pri všetkých úlohách sa vám meria čas, takže sa ich snažte riešiť čo najrýchlejšie.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "Všetky úlohy boli splnené!",
    "text": "Úspešne ste sa naučili pohybovať s hrdinom. Nasleduje ďalšia úroveň.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "Zadanie prvej úlohy",
    "text": "Váš hrdina potrebuje prejsť chodbou a dostať sa až na kamenné tlačidlo pred železnými dverami. Spojte vyžadované bloky a nastavte im potrebný počet krokov, aby sa mu to podarilo.",
    "image": "maintask0_introduction_modal"
  },
      
  "success_modal": {
    "title": "Výborne! Splnili ste prvú úlohu!",
    "text": "Váš prvý algoritmus umožnil hrdinovi úspešne doraziť ku železným dverám. Jeho cesta môže pokračovať ďalej.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "Zadanie druhej úlohy",
    "text": "Pred hrdinom sa otvorili padacie dvere a nasleduje krátka chodba, ktorá vedie k ďalšiemu kamennému tlačidlu za otvorenými dverami. Pošlite tam vášho hrdinu pomocou blokov.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Výborne! Splnili ste druhú úlohu!",
    "text": "Váš druhý algoritmus umožnil hrdinovi úspešne doraziť do skladu. Polovica cesty v tejto úrovni je už za ním.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "Zadanie tretej úlohy",
    "text": "Hrdina sa nachádza v sklade plnom vecí, medzi ktorými sa musí pohybovať. Skúste nájsť správnu cestu k najbližšiemu kamennému tlačidlu.",
    "image": "maintask2_introduction_modal"
  },
    
  "success_modal": {
    "title": "Výborne! Splnili ste tretiu úlohu!",
    "text": "Váš tretí algoritmus umožnil hrdinovi úspešne prejsť polovicu skladu. Koniec úrovne je už na dohľad.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "Zadanie štvrtej úlohy",
    "text": "Dokončite úroveň 1 a prejdite s hrdinom k poslednému kamennému tlačidlu, za ktorým už sú schody do ďalšej úrovne.",
    "image": "maintask3_introduction_modal"
  },
  
  "success_modal": {
    "title": "Výborne! Splnili ste štvrtú úlohu!",
    "text": "Hrdina prešiel chodbami a skladom až ku schodom do ďalšej úrovne.",
    "image": "success"
  }
  }

}