{
  "level":{
    "category":2,
    "level":5,
    
  "welcome_modal": {
    "title": "Category 2 Level 5",
    "text": "In the fifth level you will not find a new block - but we will repeat what was the main topic of the second category and thus working with cycles and conditions.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All levels of the game have been played!",
    "text": "Congratulations! You've successfully learned the basics of creating algorithms using Google Blockly.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "To the stone button the hero must get through the water and destroy the barrel. Use only the block repeart until the hero is at the target and solve the task without using conditions.",
    "image": "maintask0_introduction_modal"
  },
    
  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "It seems that using the doWhile cycle is really going well.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "The second task asssignment",
    "text": "To get further, the hero must open all the chests to find the door key while using all the levers to defeat the traps in the way. Use the block repeat until hero is in the target in which there will be block if it follows in the direction twice, followed by the block repeat x times, which will include a chest condition and a lever condition.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Great! You did the second task!",
    "text": "Your algorithm allowed the hero to search all the chests, use the levers to deactivate the trap, and get through the door. The hero can continue his journey.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "The third task asssignment",
    "text": "In this task, we have a stone button a little further and there are traps to avoid. At the beginning, turn the hero once to the left and then use the repeat block until the hero is in the target, twice the block if it follows in the direction and once the block if it is in the direction of the tile.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your third task! ",
    "text": "You used both conditions in your third algorithm, so the hero successfully reached the stone button.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fourth task asssignment",
    "text": "Finally, the hero needs to destroy the vases and use the lever to open the trapdoor so he can come to the last stone button in this game. Use the repeat block until the hero is in the target, once block if in the direction follows and twice block if in the direction on the tile.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your fourth task!",
    "text": "The last role in the game has just been accomplished.",
    "image": "success"
  }
  }  


}