{
  "level":{
    "category":2,
    "level":1,
    
  "welcome_modal": {
    "title": "Category 2 Level 1",
    "text": "The second game category begins and the game control system changes. From now on, you will not select the block with the correct direction or set the direction eg. while jumping. The hero's direction will already be set, shown by the yellow arrow on the player's block. To change it, you must rotate the hero using two dedicated blocks before the hero executes other commands.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All tasks completed!",
    "text": "You have successfully learned the basics of mastering the hero according to the new rules.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "In the first task, all you need is one-step motion and rotation blocks. At the beginning of the level, the hero is directed to the right, turning left counterclockwise will point him up, turning right will direct him down. Rotate it correctly and jump up to the stone button.",
    "image": "maintask0_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "Your first algorithm uses the new control system well, allowing the hero to jump to the first stone button.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "The second task assignment",
    "text": "Now the target is a bit further and there are several obstacles in the way. Destroy the barrel and avoid traps, but especially make sure that the hero always turns when necessary.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your second task!",
    "text": "You have successfully avoided all obstacles. The hero can continue his journey.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "The third task assignment",
    "text": "In this task, a lever must be used to dispose of an activated trap that cannot be avoided.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your third task!",
    "text": "You used a lever in your third algorithm so the hero could overcome a dangerous obstacle.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fourth task assignment",
    "text": "Now there's a more complicated road to the stone button with vases standing in the road that need to be destroyed.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your fourth task!",
    "text": "Well done, your hero has a target within reach.",
    "image": "success"
  }
  }
  


}