{
  "level":{
    "category":2,
    "level":3,
    
  "welcome_modal": {
    "title": "Category 2 Level 3",
    "text": "In the third level you get a new block - repeat until the hero is in the target. This block, which is a doWhile cycle, works similar to the repeat block x times, except that you don't have to set the number of repetitions. Therefore, all blocks in it will be repeated sequentially until the task is completed or an error occurs while performing action of some block.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All tasks completed!",
    "text": "You have successfully learned to use the repeat until the hero is at the target block.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "20",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "The way to the first stone button is straight and without any obstacles. Use the new block.",
    "image": "maintask0_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "The doWhile cycle is simple and runs great. Let's see how it goes on more complex tasks.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "40",  
  
    "introduction_modal": {
    "title": "The second task assignment",
    "text": "In order for the hero to go further, you must use a repeat block in addition to the new block.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Great! You did the second task!",
    "text": "You have successfully combined two cycles. The hero can continue his journey.",
    "image": "success"
  }  
  },



  "mainTask2": {
    "progress": "60",  
  
    "introduction_modal": {
    "title": "The third task assignment",
    "text": "In this task, the stone button hero must reach by jumping. You do not need to use the block repeat again x times.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Great! You've done your third task!",
    "text": "It seems that using the doWhile cycle is not a problem for you.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "80",  
  
    "introduction_modal": {
    "title": "The fourth task assignment",
    "text": "Getting to the next stone button is harder this time, one of the blocks has a trap. Turn it off with the lever. Also, use the repeat block x times that you put inside.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Great! You've completed your fourth task!",
    "text": "Well done, your hero already has a target within reach.",
    "image": "success"
  }
  },
  
    "mainTask4": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fifth task assignment",
    "text": "In the last task of this level, use both cycles again - with the for loop inside the doWhile loop. Turn the hero once to the right before using the doWhile cycle.",
    "image": "maintask4_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You have completed your fifth task!",
    "text": "Obviously, you can master both cycles perfectly.",
    "image": "success"
  }
  }

}