{
  "level":{
    "category":2,
    "level":1,
    
  "welcome_modal": {
    "title": "Kategória 2 Úroveň 1",
    "text": "Začína sa druhá kategória hry a herný systém ovládania sa mení. Odteraz nebudete vyberať blok so správnym smerom alebo nastavovať smer napr. pri skákaní. Smer hrdinu už bude nastavený, zobrazený žltou šipkou na bloku. Na jeho zmenu musíte hrdinu otáčať pomocou dvoch blokov na to určených, predtým, ako hrdina vykonáva ostatné príkazy.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "Všetky úlohy boli splnené!",
    "text": "Úspešne ste sa naučili základy ovládania hrdinu podľa nových pravidiel.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "Zadanie prvej úlohy",
    "text": "V prvej úlohe vám stačia bloky pohybu o jeden krok a otáčania. Na začiatku úrovne je hrdina nasmerovaný doprava, otočenie doľava ho nasmeruje hore, otočenie doprava ho nasmeruje dole. Správne ho otáčajte a preskákajte s ním až ku kamennému tlačidlu.",
    "image": "maintask0_introduction_modal"
  },

  "success_modal": {
    "title": "Výborne! Splnili ste prvú úlohu!",
    "text": "Váš prvý algoritmus využíva nový systém ovládania a tým umožnil hrdinovi preskočiť na prvé kamenné tlačidlo.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "Zadanie druhej úlohy",
    "text": "Teraz už je cieľ o niečo ďalej a v ceste už stojí viacero prekážok. Zničte sud a vyhnite sa pasciam, ale hlavne dávajte pozor, aby sa hrdina vždy otočil, keď je to potrebné.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Výborne! Splnili ste druhú úlohu!",
    "text": "Úspešne ste sa vyhli všetkým prekážkam. Hrdina môže pokračovať ďalej v ceste.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "Zadanie tretej úlohy",
    "text": "V tejto úlohe je treba použiť páku, aby sa zneškodnila aktivovaná pasca, ktorej sa nedá vyhnúť.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Výborne! Splnili ste tretiu úlohu!",
    "text": "Vo vašom treťom algoritme ste použili páku a hrdina tak mohol prekonať nebezpečnú prekážku.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "Zadanie štvrtej úlohy",
    "text": "Ku kamennému tlačidlu pre splnenie tejto úlohy vedie komplikovanejšia cesta s vázami stojacimi v ceste, ktoré treba zničiť.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Výborne! Splnili ste štvrtú úlohu!",
    "text": "Dobrá práca, váš hrdina má cieľ na dosah.",
    "image": "success"
  }
  }
  


}