{
  "level":{
    "category":1,
    "level":2,
    
  "welcome_modal": {
    "title": "Category 1 Level 2",
    "text": "In the second level the hero gains a new ability - jumping. He will need this ability to get through the flooded part of the castle.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All tasks completed!",
     "text": "You have successfully learned to jump with the hero. The next level follows.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "Your hero needs to jump over places flooded with water to get to the nearest stone button on the right. Connect blocks of movement and jump so that he succeeds.",
    "image": "maintask0_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "Your first algorithm at this level allowed the hero to jump over the flooded parts.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "The second task assignment",
    "text": "The journey on this shore is no longer on and so the hero has to go again through the water, this time to the island on the left. Connect blocks of movement and jump so that the hero comes to the stone button near the wall with fire.",
    "image": "maintask1_introduction_modal"
  },
    
  "success_modal": {
    "title": "Well done! You've completed your second task!",
    "text": "The hero has arrived at the target thanks to the correct algorithm.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "The third task assignment",
    "text": "In this task, the hero just needs to go and jump in one direction to get to the right side of the remote stone button.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your third task!",
    "text": "The hero has successfully overcome the flooded part of the level and is approaching the final destination.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fourth task assignment",
    "text": "The hero no longer has to jump over the water, but now he has a dangerous obstacle ahead - activated traps. Avoid them and get to the stone button at the stairway to the next level.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your fourth task!",
    "text": "It seems that using jump does not make you the slightest problem. You made it through the water and traps.",
    "image": "success"
  }
  }

}