{
  "level":{
    "category":2,
    "level":4,
    
  "welcome_modal": {
    "title": "Category 2 Level 4",
   "text": "In the fourth level you get up to two new blocks - a block if it follows in the direction and a block if it is in the direction of the tile. These blocks act as if conditions, so other blocks inserted in them are executed only if the specified condition is met. This allows us to execute various commands depending on where the hero is.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All tasks completed!",
    "text": "You have successfully learned to use the conditions. The final level of the game follows.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "The road to the first stone button is not blocked by any obstacles, but the hero must always turn in the right place. Use the block repeat until the hero is in the target and twice the block if it follows in the direction.",
    "image": "maintask0_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "Your first condition algorithm worked well and the hero arrived at the stone button.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "The second task assignment",
    "text": "In order to get further, the hero must use every lever in the way to defeat the traps and open the trapdoor. Use the Repeat block until the hero is in the target, the block if it follows in the direction and the block if it is in the direction of the tile.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your second task!",
    "text": "You have successfully eliminated the traps and opened the door. The hero can continue his journey.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "The third task assignment",
    "text": "In this task, there are vases in the hero's path that need to be destroyed and at the same time the hero needs to change direction when there is water or a wall in front of him. At the beginning, turn the hero once to the right and then use the repeat block until the hero is in the target, the block if in the direction following, and the block if in the direction of the tile.",
    "image": "maintask2_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You've completed your third task!",
    "text": "In your third algorithm, you used both conditions exactly as specified.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fourth task assignment",
    "text": "There is a short path to the stone button to complete this level, but there are traps and water to avoid. First point the hero to the right and then use the repeat block until the hero is in the target, the block if in the direction and the block in the direction of the tile.",
    "image": "maintask3_introduction_modal"
  },

  "success_modal": {
    "title": "Great! You've completed your fourth task!",
    "text": "Well done, your hero got to the finish."
    "image": "success"
  }
  }  


}