{
  "level":{
    "category":1,
    "level":1,
    
   "welcome_modal": {
    "title": "Category 1 Level 1",
    "text": "In the first level, we will introduce the basis of control, which is movement. The hero can move in four directions. Select the block with the necessary direction of movement, attach it to the player block and set the number of steps. Then click Run Blocks. Your game character will then try to execute commands. All your tasks take time, so try to solve them as quickly as possible.",
    "image": "welcome_modal"
  },
  
   "finish_modal": {
    "title": "All tasks completed!",
    "text": "You have successfully learned to move with the hero. The next level follows.",
    "image": "success"  
  }
  },
  
  "mainTask0":{
    "progress": "25",
    
    "introduction_modal": {
    "title": "The first task assignment",
    "text": "Váš hrdina potrebuje prejsť chodbou a dostať sa až na kamenné tlačidlo pred železnými dverami. Spojte vyžadované bloky a nastavte im potrebný počet krokov, aby sa mu to podarilo.",
    "image": "maintask0_introduction_modal"
  },
      
  "success_modal": {
    "title": "Well done! You've completed your first task!",
    "text": "Your first algorithm allowed the hero to successfully reach the iron door. His journey can continue.",
    "image": "success"
  }
  },
  
  "mainTask1": {
    "progress": "50",  
  
    "introduction_modal": {
    "title": "The second task assignment",
    "text": "A trapdoor was opened in front of the hero, followed by a short corridor that leads to another stone button behind the open door. Send your hero there using blocks.",
    "image": "maintask1_introduction_modal"
  },

  "success_modal": {
    "title": "Well done! You have completed the second task!",
    "text": "Your second algorithm allowed the hero to successfully reach the warehouse. Half the way at this level is already behind him.",
    "image": "success"
  }
  },



  "mainTask2": {
    "progress": "75",  
  
    "introduction_modal": {
    "title": "The third task assignment",
    "text": "The hero is in a store full of things and he must move between them. Try to find the right way to the nearest stone button.",
    "image": "maintask2_introduction_modal"
  },
    
  "success_modal": {
    "title": "Well done! You've completed your third task!",
    "text": "Your third algorithm allowed the hero to successfully pass half the warehouse. The end of the level is already in sight.",
    "image": "success"
  }
  },
  
    "mainTask3": {
    "progress": "100",  
  
    "introduction_modal": {
    "title": "The fourth task assignment",
    "text": "Complete level 1 and go with the hero to the last stone button, which is followed by stairs to the next level.",
    "image": "maintask3_introduction_modal"
  },
  
  "success_modal": {
    "title": "Well done! You've completed your fourth task!",
    "text": "The hero walked down the corridors and into the storehouse to the next level.",
    "image": "success"
  }
  }

}